Revit 2027 API
PropertySetElement.Create(Document, ThermalAsset) Method
 Creates a new PropertySetElement to contain the given asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PropertySetElement Create(
	Document document,
	ThermalAsset thermalAsset
)
Public Shared Function Create (
	document As Document,
	thermalAsset As ThermalAsset
) As PropertySetElement
public:
static PropertySetElement^ Create(
	Document^ document,
	ThermalAsset^ thermalAsset
)
static member Create :
        document : Document *
        thermalAsset : ThermalAsset -> PropertySetElement
Parameters
document Document
 The document in which to create the PropertySetElement.
thermalAsset ThermalAsset
 The thermal asset containing the values that will be present in the PropertySetElement.
Return Value
PropertySetElement
 The new PropertySetElement.
Exceptions
Exception | Condition
ArgumentException |  Thrown when the name of the asset is empty, contains prohibited characters, or is not unique
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PropertySetElement Class
Create Overload
Autodesk.Revit.DB Namespace